FutureDesigns/uEZ/uEZ/Source/Platform/FDI/CARRIER_RX62N/CARRIER_RX62N.c
/*-------------------------------------------------------------------------*
 * File:  CARRIER_RX62N.c
 *-------------------------------------------------------------------------*
 * Description:
 *      Bring up the CARRIER_RX62N
 *-------------------------------------------------------------------------*/

/*--------------------------------------------------------------------------
 * uEZ(R) - Copyright (C) 2007-2015 Future Designs, Inc.
 *--------------------------------------------------------------------------
 * This file is part of the uEZ(R) distribution.  See the included
 * uEZ License.pdf or visit http://goo.gl/UDtTCR for details.
 *
 *    *===============================================================*
 *    |  Future Designs, Inc. can port uEZ(r) to your own hardware!  |
 *    |             We can get you up and running fast!               |
*    |      See http://goo.gl/UDtTCR for more details.               |
 *    *===============================================================*
 *
 *-------------------------------------------------------------------------*/
#include <Config.h>

#include <uEZ.h>
#include <uEZADC.h>
#include <uEZAudioAmp.h>
#include <uEZBSP.h>
#include <uEZDevice.h>
#include <uEZDeviceTable.h>
#include <uEZFile.h>
#include <uEZNetwork.h>
#include <uEZProcessor.h>
#include <uEZStream.h>
#include <UEZPlatformAPI.h>

#include <Device/SPIBus.h>
#include <Device/ADCBank.h>
#include <Device/AudioAmp.h>
#include <Device/FileSystem.h>
#include <Device/Flash.h>
#include <Device/LCD.h>
#include <Device/MassStorage.h>
#include <Device/RTC.h>
#include <Device/I2CBus.h>
#include <Device/PWM.h>
#include <Device/Stream.h>
#include <Device/ToneGenerator.h>
#include <Device/Touchscreen.h>

#include <Source/Devices/ADC/Generic/Generic_ADC.h>
#include <Source/Devices/AudioAmp/NXP/TDA8551_T/AudioAmp_TDA8551T.h>
#include <Source/Devices/Backlight/Generic/BacklightPWMControlled/BacklightPWM.h>
#include <Source/Devices/Flash/Renesas/RX62N/Flash_Renesas_RX62N.h>
#include <Source/Devices/MassStorage/SDCard/SDCard_MS_driver_SPI.h>
#include <Source/Devices/Network/lwIP/Network_lwIP.h>
#include <Source/Devices/Touchscreen/Generic/DirectDrive/DirectDrive_TS.h>
#include <Source/Devices/ToneGenerator/Generic/PWM/ToneGenerator_Generic_PWM.h>
#include <Source/Devices/I2C/Generic/Generic_I2C.h>
#include <Source/Devices/RTC/Generic/Generic_RTC.h>   
#include <Source/Devices/RTC/NXP/PCF8563/RTC_PCF8563.h>
#include <Source/Devices/Temperature/NXP/LM75A/Temperature_LM75A.h>
#include <Source/Devices/Accelerometer/Freescale/MMA7455/Freescale_MMA7455.h>
#include <Source/Devices/Audio Codec/Wolfson/WM8731/AudioCodec_WM8731.h>
#include <Source/Devices/Button/NXP/PCA9551/Button_PCA9551.h>
#include <Source/Devices/LED/NXP/PCA9551/LED_NXP_PCA9551.h>

#include <Source/Processor/Renesas/RX62N/uEZProcessor_RX62N.h>
#include <Source/Processor/Renesas/RX62N/RX62N_ADCBank_S12AD.h>
#include <Source/Processor/Renesas/RX62N/RX62N_DTC.h>
#include <Source/Processor/Renesas/RX62N/RX62N_EMAC.h>
#include <Source/Processor/Renesas/RX62N/RX62N_ExternalInterrupt.h>
#include <Source/Processor/Renesas/RX62N/RX62N_Flash.h>
#include <Source/Processor/Renesas/RX62N/RX62N_GPIO.h>
#include <Source/Processor/Renesas/RX62N/RX62N_I2C.h>
#include <Source/Processor/Renesas/RX62N/RX62N_PWM_MTU.h>
#include <Source/Processor/Renesas/RX62N/RX62N_PWM_TMR.h>
#include <Source/Processor/Renesas/RX62N/RX62N_Serial.h>
#include <Source/Processor/Renesas/RX62N/RX62N_SPI.h>
#include <Source/Processor/Renesas/RX62N/RX62N_UtilityFuncs.h>
#include <Source/Processor/Renesas/RX62N/RX62N_RTC.h>

#include <Source/Library/GUI/FDI/SimpleUI/SimpleUI_Types.h>
#include <Source/Library/GUI/FDI/SimpleUI/SimpleUI.h> // Needs to go away!

#include <UEZPlatform.h>
#include <uEZAudioMixer.h>

#include "DirectDrive/DirectLCD_CNF.h"

/*---------------------------------------------------------------------------*
 * Globals:
 *---------------------------------------------------------------------------*/
T_uezTask G_mainTask;
static T_uezDevice G_stdout = 0;
static T_uezDevice G_stdin = 0;

/*---------------------------------------------------------------------------*
 * Initialize the Vector Table
 *---------------------------------------------------------------------------*/
#include <RXToolset/vecttbl.c>

/*---------------------------------------------------------------------------*
 * Setting of B,R Section
 *---------------------------------------------------------------------------*/
#include <RXToolset/dbsct.c>

/*---------------------------------------------------------------------------*
 * Provide low level access to STD In/Out calls
 *---------------------------------------------------------------------------*/
#include <RXToolset/lowsrc.c>

/*---------------------------------------------------------------------------*
 * Routine:  vApplicationSetupTimerInterrupt
 *---------------------------------------------------------------------------*
 * Description:
 *      The RX port uses this callback function to configure its tick   
 *		interrupt. This allows the application to choose the tick interrupt
 *		source.
 *---------------------------------------------------------------------------*/
void vApplicationSetupTimerInterrupt(void)
{
    /* Enable compare match timer 0. */
    MSTP( CMT0) = 0;

    /* Interrupt on compare match. */
    CMT0.CMCR.BIT.CMIE = 1;

    /* Set the compare match value. */
    CMT0.CMCOR = (unsigned short)(((PCLK_FREQUENCY / configTICK_RATE_HZ) - 1) / 8);

    /* Divide the PCLK by 8. */
    CMT0.CMCR.BIT.CKS = 0;

    /* Enable the interrupt... */
    _IEN( _CMT0_CMI0) = 1;

    /* ...and set its priority to the application defined kernel priority. */
    _IPR( _CMT0_CMI0) = configKERNEL_INTERRUPT_PRIORITY;

    /* Start the timer. */
    CMT.CMSTR0.BIT.STR0 = 1;
}

/*---------------------------------------------------------------------------*
 * Task:  Heartbeat
 *---------------------------------------------------------------------------*
 * Description:
 *      Blink heartbeat LED
 * Inputs:
 *      T_uezTask aMyTask            -- Handle to this task
 *      void *aParams               -- Parameters.  Not used.
 * Outputs:
 *      TUInt32                     -- Never returns.
 *---------------------------------------------------------------------------*/
TUInt32 Heartbeat(T_uezTask aMyTask, void *aParams)
{
	UEZGPIOOutput(GPIO_PG6);
    // Blink
    for (;;) {
		UEZGPIOSet(GPIO_PG6);
		UEZTaskDelay(250);
		UEZGPIOClear(GPIO_PG6);
		UEZTaskDelay(250);
    }                    
}                            

/*---------------------------------------------------------------------------*
 * Routine:  UEZBSPDelayMS
 *---------------------------------------------------------------------------*
 * Description:
 *      Use a delay loop to approximate the time to delay.
 *      Should use UEZTaskDelayMS() when in a task instead.
 *---------------------------------------------------------------------------*/
void UEZBSPDelayMS(unsigned int aMilliseconds)
{
    TUInt32 i;
    // TODO: Calibrate based on the speed of processor
    for (i = 0; i < 96000; i++) {
    }
}

/*---------------------------------------------------------------------------*
 * Routine:  UEZBSP_PLLConfigure
 *---------------------------------------------------------------------------*
 * Description:
 *      Configure the PLL
 *---------------------------------------------------------------------------*/
void UEZBSP_PLLConfigure(void)
{
	TUInt32 sckcr = 0;
	
