FutureDesigns/uEZ/uEZ/Source/Platform/FDI/CARRIER_RX62N/CARRIER_RX62N.c
#if 0
    MemoryTest(UEZBSP_SDRAM_BASE_ADDR, UEZBSP_SDRAM_SIZE);         
#endif

    /* connect MTU channel 3 to B pins */
    IOPORT.PFCMTU.BYTE = 0x0C;
    /* Connect DMAREQ0-C to P55 and DMAREQ0-A to P54 */
    IOPORT.PF7DMA.BIT.EDMA0S = 2;

    /* Enable hardware as necessary */
    MSTP(DTC) = 0;    /* enable DTC */
    MSTP(EXDMAC) = 0; /* enable ExDMA */
    MSTP(MTU0) = 0;   /* enable TPU 0-5 */
    MSTP(CRC) = 0;    /* enable CRC 0-5 */

    MTUA.TOER.BYTE = 0xFF; /* turn on all OE based outputs */
}

/*---------------------------------------------------------------------------*
 * Routine:  UEZBSP_ROMInit
 *---------------------------------------------------------------------------*
 * Description:
 *      Initialize the external ROM.
 *---------------------------------------------------------------------------*/
void UEZBSP_ROMInit(void)
{
    // No External ROM
}

/*---------------------------------------------------------------------------*
 * Routine:  UEZBSP_FatalError
 *---------------------------------------------------------------------------*
 * Description:
 *      A fatal error in uEZ will come here last.  We must turn off
 *      interrupts and put the platform in a halted state with a blinking
 *      LED.
 * Inputs:
 *      int aErrorCode -- Blink the LED a number of times equal to
 *          the error code.
 *---------------------------------------------------------------------------*/
void UEZBSP_FatalError(int aErrorCode)
{
    register TUInt32 i;
    register TUInt32 count;

	// Stop running any other tasks
	UEZTaskSchedulerSuspend();

    // Port G bit 7 is the LED on the SOMDIMM-RX62N
    // Set it for output and blink it
    PORTG.DDR.BIT.B7 = 1;

    // Blink our status led in a pattern, forever
    count = 0;
    while (1) {
        PORT1.DR.BIT.B5 = 0;
        for (i=0; i<2000000; i++)
            ;
        PORT1.DR.BIT.B5 = 1;
        for (i=0; i<2000000; i++)
            ;
        count++;
        if (count >= aErrorCode) {
            // Long pause
            for (i=0; i<10000000; i++)
                ;
            count = 0;
        }
    }
}

/*---------------------------------------------------------------------------*
 * Routine:  UEZPlatform_Console_FullDuplex_UART_Require
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the console using a full duplex UART.
 * Inputs:
 *      const char *aHALSerialName -- Name of UART serial driver to use
 *      TUInt32 aWriteBufferSize -- Size in bytes of outgoing buffer
 *      TUInt32 aReadBufferSize -- Size in bytes of incoming buffer
 *---------------------------------------------------------------------------*/
void UEZPlatform_Console_FullDuplex_SCI_Require(
        const char *aHALSerialName,
        TUInt32 aWriteBufferSize,
        TUInt32 aReadBufferSize)
{
    DEVICE_CREATE_ONCE();

    Serial_Generic_FullDuplex_Stream_Create("Console", aHALSerialName,
            aWriteBufferSize, aReadBufferSize);

    // Set standard output to console
    UEZStreamOpen("Console", &G_stdout);
    G_stdin = G_stdout;
    StdinRedirect(G_stdin);
    StdoutRedirect(G_stdout);
}

/*---------------------------------------------------------------------------*
 * Routine:  UEZPlatform_Console_Require
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the console to be a full duplex UART on the expansion header
 *      NOTE: On expansion header
 * Inputs:
 *      TUInt32 aWriteBufferSize -- Size in bytes of outgoing buffer
 *      TUInt32 aReadBufferSize -- Size in bytes of incoming buffer
 *---------------------------------------------------------------------------*/
void UEZPlatform_Console_Require(
        TUInt32 aWriteBufferSize,
        TUInt32 aReadBufferSize)
{
    // Standard Expansion board serial console is on SCI0
	RX62N_SCI0_Require();
    UEZPlatform_Console_FullDuplex_SCI_Require("SCI0", aWriteBufferSize,
            aReadBufferSize);
}

/*---------------------------------------------------------------------------*
 * Routine:  UEZPlatform_PWM_MTU9_Require
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the backlight device driver
 *---------------------------------------------------------------------------*/
void UEZPlatform_PWM_MTU9_Require(void)
{
    DEVICE_CREATE_ONCE();

	RX62N_PWM_MTU9_Require();
	
	PWM_Generic_Create("PWM_MTU9", "PWM_MTU9");
}

/*---------------------------------------------------------------------------*
 * Routine:  UEZPlatform_BacklightMasterCallback
 *---------------------------------------------------------------------------*
 * Description:
 *      Master MTU9 callback function for clearing the GPIO PWM backlight pin
 *---------------------------------------------------------------------------*/
void UEZPlatform_BacklightMasterCallback(void *aWorkspace)
{
	UEZGPIOClear(GPIO_P93);
}

/*---------------------------------------------------------------------------*
 * Routine:  UEZPlatform_BacklightMatchCallback
 *---------------------------------------------------------------------------*
 * Description:
 *      Slave MTU9 callback function for setting the GPIO PWM backlight pin
 *---------------------------------------------------------------------------*/
void UEZPlatform_BacklightMatchCallback(void *aWorkspace)
{
	UEZGPIOSet(GPIO_P93);
}

/*---------------------------------------------------------------------------*
 * Routine:  UEZPlatform_Backlight_Require
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the Backlight device driver for the LCD
 *---------------------------------------------------------------------------*/
void UEZPlatform_Backlight_Require(void)
{
    const T_backlightGenericPWMSettings settings = {
            "PWM_MTU9",
            1, // master register
            0, // backlight register (TMO0)
            UEZ_LCD_BACKLIGHT_FULL_PERIOD,
            UEZ_LCD_BACKLIGHT_FULL_PWR_OFF,
			UEZ_LCD_BACKLIGHT_FULL_PWR_ON,
            GPIO_NONE,
            EFalse
    };
    T_uezDevice pwmDevice;
	
    DEVICE_CREATE_ONCE();

	UEZPlatform_PWM_MTU9_Require();
	UEZDeviceTableFind("PWM_MTU9", &pwmDevice);
	
	// The PWM backlight is output by setting and clearing a GPIO pin
	// through software by using Callback routines.
	UEZGPIOClear(GPIO_P93);
	UEZGPIOOutput(GPIO_P93);
	UEZPWMSetMatchCallback(pwmDevice, 0, UEZPlatform_BacklightMasterCallback, 0);
	UEZPWMSetMatchCallback(pwmDevice, 1, UEZPlatform_BacklightMatchCallback, 0);
	
