FutureDesigns/uEZ/uEZ/Source/Platform/FDI/CARRIER_RX62N/CARRIER_RX62N.c
    UEZPlatform_Console_Require(UEZ_CONSOLE_WRITE_BUFFER_SIZE,
            UEZ_CONSOLE_READ_BUFFER_SIZE);
	UEZPlatform_Touchscreen_Require();
	UEZPlatform_DataFlash_Require();
	UEZPlatform_Speaker_Require();
	UEZPlatform_AudioAmp_Require();
	UEZPlatform_AudioCodec_Require();
	UEZPlatform_SDCard_Drive_Require(1);
	UEZPlatform_WiredNetwork0_Require();
	
	UEZPlatform_Accel0_Require();
	UEZPlatform_Temp0_Require();
	UEZPlatform_RTC_Require();
	UEZPlatform_IRTC_Require();
	UEZPlatform_Button_Require();
	UEZPlatform_LED_Require();
	UEZPlatform_AudioMixer_Require();
}

void UEZPlatform_Full_Require(void)
{
    // Setup console immediately
	UEZPlatform_LCD_Require();
	
    UEZPlatform_Console_Require(UEZ_CONSOLE_WRITE_BUFFER_SIZE,
            UEZ_CONSOLE_READ_BUFFER_SIZE);
	UEZPlatform_Touchscreen_Require();
	UEZPlatform_DataFlash_Require();
	UEZPlatform_Speaker_Require();
	UEZPlatform_AudioAmp_Require();
	UEZPlatform_AudioCodec_Require();
	UEZPlatform_SDCard_Drive_Require(1);
	UEZPlatform_WiredNetwork0_Require();
	
	UEZPlatform_Accel0_Require();
	UEZPlatform_Temp0_Require();
	UEZPlatform_RTC_Require();
	UEZPlatform_IRTC_Require();
	UEZPlatform_Button_Require();
	UEZPlatform_LED_Require();
}

void UEZPlatform_Minimal_Require(void)
{
    // Setup console immediately
    UEZPlatform_Console_Require(UEZ_CONSOLE_WRITE_BUFFER_SIZE,
            UEZ_CONSOLE_READ_BUFFER_SIZE);
    UEZPlatform_LCD_Require();
}

void UEZPlatform_Require(void)
{
    // Choose one:
    //UEZPlatform_Minimal_Require();
    //UEZPlatform_Standard_Require();  
    UEZPlatform_Full_Require();
}

// Modify pins for Application Header before use, modify get, set, clear routine for RX
void UEZPlatform_WiFiProgramMode(TBool runMode)
{    
#define GPIO_WIFI_FAC_RST       GPIO_NONE
#define GPIO_WIFI_SRSTn         GPIO_NONE
#define GPIO_WIFI_IRQ           GPIO_NONE
#define GPIO_WIFI_MODE          GPIO_NONE

    if(runMode == ETrue) {
        printf("GainSpan Run Mode ...\n");        
    } else {
        printf("GainSpan Programming Mode ...\n");
    }
    RTOS_ENTER_CRITICAL();
    
    UEZGPIOSet(GPIO_WIFI_FAC_RST);        // WIFI_FAC_RST
    UEZGPIOSetMux(GPIO_WIFI_FAC_RST, 0);
    UEZGPIOOutput(GPIO_WIFI_FAC_RST);
    
    UEZGPIOClear(GPIO_WIFI_SRSTn);        // WIFI_SRSTn
    UEZGPIOSetMux(GPIO_WIFI_SRSTn, 0);
    UEZGPIOOutput(GPIO_WIFI_SRSTn);       // WIFI_SRSTn
    
    UEZGPIOInput(GPIO_WIFI_IRQ);       // WIFI IRQ

    if(runMode == ETrue) {
        UEZGPIOClear(GPIO_WIFI_MODE);  // WIFI RUN MODE
    } else {
        UEZGPIOSet(GPIO_WIFI_MODE);    // WIFI PROGRAM ON
    }
    UEZGPIOOutput(GPIO_WIFI_MODE);       
                
    UEZGPIOUnlock(GPIO_P00);       // RX6XN TX
    UEZGPIOSetMux(GPIO_P00, 0);
    UEZGPIOOutput(GPIO_P00);

    UEZGPIOUnlock(GPIO_P01);       // RX6XN RX
    UEZGPIOSetMux(GPIO_P01, 0);
    UEZGPIOInput(GPIO_P01);

    UEZGPIOUnlock(GPIO_NONE);      // WIFI TX
    UEZGPIOSetMux(GPIO_NONE, 0);
    UEZGPIOOutput(GPIO_NONE);

    UEZGPIOUnlock(GPIO_NONE);      // WIFI RX
    UEZGPIOSetMux(GPIO_NONE, 0);
    UEZGPIOInput(GPIO_NONE);

    //UEZTaskDelay(1000); // for debug
    UEZGPIOSet(GPIO_WIFI_SRSTn);          // WIFI_SRSTn

    //CPUDisableInterrupts(); // need to change to RX version
    while (1) {
        /*if (LPC_GPIO0->PIN & (1 << 3))  // RX6XN RX = GPIO_P01
            LPC_GPIO0->SET = (1 << 15); // WIFI TX = ?
        else
            LPC_GPIO0->CLR = (1 << 15);

        if (LPC_GPIO0->PIN & (1 << 16)) // WIFI RX = ?
            LPC_GPIO0->SET = (1 << 2);  // RX6XN TX = GPIO_P00
        else
            LPC_GPIO0->CLR = (1 << 2);  // RX6XN TX = GPIO_P00
            */
    }
}

TUInt16 UEZPlatform_LCDGetHeight(void)
{
    return UEZ_LCD_DISPLAY_HEIGHT;
}
TUInt16 UEZPlatform_LCDGetWidth(void)
{
    return UEZ_LCD_DISPLAY_WIDTH;
}
#include <Source/Library/GUI/FDI/SimpleUI/SimpleUI_Types.h>
TUInt32 UEZPlatform_LCDGetFrame(TUInt16 aFrameNum)
{
    return (TUInt32)FRAME(aFrameNum);
}
TUInt32 UEZPlatform_LCDGetFrameBuffer(void)
{
    return (TUInt32)LCD_FRAME_BUFFER;
}
TUInt32 UEZPlatform_LCDGetFrameSize(void)
{
    return FRAME_SIZE;
}
TUInt32 UEZPlatform_SerialGetDefaultBaud(void)
{
    return SERIAL_PORTS_DEFAULT_BAUD;
}
TUInt32 UEZPlatform_ProcessorGetFrequency(void)
{
    return PROCESSOR_OSCILLATOR_FREQUENCY;
}
TUInt32 UEZPlatform_GetEMACPHYAddress(void)
{
    return 1; // National DP83640
}
TUInt32 UEZPlatform_GetBaseAddress(void)
{
    return LCD_DISPLAY_BASE_ADDRESS;
}
#if INCLUDE_EMWIN
#include <Source/Library/GUI/SEGGER/emWin/LCD.h>
#include <Source/Library/GUI/SEGGER/emWin/GUIDRV_Lin.h>
const void* UEZPlatform_GUIColorConversion(void)
{
    return GUICC_M555;
}

const void *UEZPlatform_GUIDisplayDriver()
{
    return &GUIDRV_Lin_16_API;
}
#else
const void* UEZPlatform_GUIColorConversion(void)
{
    return 0;
}

const void *UEZPlatform_GUIDisplayDriver()
{
    return 0;
}
#endif

T_pixelColor SUICallbackRGBConvert(int r, int g, int b)
{
    return RGB(r, g, b);
}

void *SUICallbackGetLCDBase(void)
{
    return (void *)(LCD_FRAME_BUFFER);
}
    
void SUICallbackSetLCDBase(void *aBaseAddress)
{
    extern TUInt16 * LCDSetActiveRaster(TUInt32 frame_request);
    extern void HandleFail(void);

    LCDSetActiveRaster((TUInt32)aBaseAddress);
}

extern void WriteByteInFrameBufferWithAlpha(
        UNS_32 aAddr,
        COLOR_T aPixel,
        T_swimAlpha aAlpha)
{
    static COLOR_T mask = ~((1 << 10) | (1 << 5) | (1 << 0));
    COLOR_T *p = (COLOR_T *)aAddr;

    switch (aAlpha) {
        case SWIM_ALPHA_50:
            *p = (((*p & mask) >> 1) + ((aPixel & mask) >> 1));
            break;
    }
}

void UEZPlatformWriteChar(char aChar)
{
    putchar(aChar);
}

void ForceCodeNotToBeRemovedDuringOptimizedLink(void)
{
	extern void vSoftwareInterruptEntry(void);
	
	// This code is a trick to the HEW compiler.  It ensures
	// the the list of functions are definitely compiled into
	// the code instead of being optimized out.  Without this
	// function, the uEZ code will not work with HEW Renesas RX
	// compiler! -- 3/19/2012
	vSoftwareInterruptEntry();
}

/*---------------------------------------------------------------------------*
 * Routine:  UEZPlatform_System_Reset
 *---------------------------------------------------------------------------*
 * Description:
 *      Do a board specific system reset. In some cases we have a pin that
 *      can trigger POR as if you pushed a physical reset button
 *---------------------------------------------------------------------------*/
void UEZPlatform_System_Reset(void){
    //NVIC_SystemReset();
	// need equiv for RX here
}

/*---------------------------------------------------------------------------*
 * Routine:  main
 *---------------------------------------------------------------------------*
 * Description:
 *      The main() routine in UEZ is only a stub that is used to start
 *      the whole UEZ system.  UEZBSP_Startup() is immediately called.
 * Outputs:
 *      int -- not used, 0
 *---------------------------------------------------------------------------*/
int main(void)
{
    UEZBSP_Startup();
    while (1) {
		// never should get here
		ForceCodeNotToBeRemovedDuringOptimizedLink();
    } 
}

/*-------------------------------------------------------------------------*
 * End of File:  uEZPlatform.c
 *-------------------------------------------------------------------------*/
